{
  "itemDisplayName": "Tabo",
  "description": "Tabo connects Your Processes, Equipment & Plant Data to Real Time Sensory data for Predictive MaintenanceIt delivers Predictive Maintenance with IOT by ingesting historical plant and equipment procurement and maintenance data from ERP systems (such as SAP, Dynamics etc.), while gathering real-time telemetry data from field/plant or 3rd party sensors (equipment sensors, Cisco Jasper etc.) and thereon combining the two to execute Machine Learning algorithms in real time to detect anomalies & thereon batch analytics for deeper insights and patterns to provide predictive maintenance alerts and recommendations, resulting in operational efficiency, lower costs and increased productivity in wide range of industries.",
  "summary": "Microsoft Azure based product that delivers Predictive Maintenance with IOT by ingesting historical plant and equipment procurement and maintenance data from ERP systems (such as SAP, Microsoft Dynamics etc.), while gathering real-time telemetry data from field & plant and/or 3rd party sensors (equipment sensors, Cisco Jasper, OBD II etc.) and thereon combining all these data types to execute Machine Learning algorithms in real time to detect anomalies & thereon batch analytics for deeper insights and patterns to provide predictive maintenance alerts and recommendations that directly result in operational efficiency, lower costs and increased productivity in wide range of industries.Businesses are always looking for a competitive advantage through technology innovation.  Advancements in hardware technology have enabled reliable sensors that provide vital statistics about the health of connected machines.  On the software side, we have secure and scalable cloud platforms like Microsoft Azure that can process this sensor data in real-time to give actionable insights.Tabo, a state-of-the-art IoT solution can be applied to multiple scenarios.Predictive maintenance however, can minimize production downtime, improve safety and optimize costs.Manufacturing organizations have ERP systems such as SAP or Microsoft-Dynamics that capture historical maintenance data. Data sets, such as maintenance notifications contain useful information about past equipment failures.We ingest data from ERP system into Microsoft Cloud platform and apply state of the art machine learning algorithms to train a predictive model. The streaming sensor data from each equipment is run against this model in real-time to result a safety-score indicating a likelihood of failure.Microsoft Power BI is used to visualize this safety-score along with the streaming data points from the equipment such as temperature, frequency and voltage fluctuation. As the safety-score goes below a threshold, context-sensitive maintenance-alerts are send to person responsible who could take proactive action.Tabo, a Predictive Maintenance offering on Microsoft Azure ultimately results in a competitive edge for your business.",
  "githubUsername": "mukulkgupta",
  "dateUpdated": "2016-12-23"
}