{
  "itemDisplayName": "Syncfusion Dashboard Server",
  "description": "<p><a href='https://help.syncfusion.com/dashboard-platform/dashboard-server/administration/manage-dashboards'>Dashboard management</a> Dashboards are efficiently organized under the categories. Permission to view the Dashboards can be given to specific users or groups.</p><p><a href=\"https://help.syncfusion.com/dashboard-platform/dashboard-server/data-alerts\">Data Alerts</a> Lets you subscribe to data changes in your dashboards.</p><p><b>Designer integration</b> Seamlessly design and publish Dashboards from within the <a href= \"https://help.syncfusion.com/dashboard-platform/dashboard-designer/overview\">Syncfusion Dashboard Designer</a> application.</p><p><a href=\"https://help.syncfusion.com/dashboard-platform/dashboard-server/administration/manage-dashboards#version-history\">Versioning</a> All items stored in the Dashboard server are versioned, so it is possible to revert to an older version.</p><p><a href=\"https://help.syncfusion.com/dashboard-platform/dashboard-server/administration/manage-users\">User management</a> Users can be easily organized into groups to accurately map the structure of the small and large organizations.</p><p><a href=\"https://help.syncfusion.com/dashboard-platform/dashboard-server/administration/manage-schedules\">Scheduling</a> Dashboards can be exported into an image file and emailed according to flexible schedules.</p><p><a href=\"https://help.syncfusion.com/dashboard-platform/dashboard-server/administration/manage-permissions\">Flexible permissions</a> A flexible permission scheme controls the access to read, write, and delete Dashboards.</p><p><b>View Dashboards</b> The built-in HTML 5 Dashboard Viewer control lets the user to view Dashboards from within the browser.</p><p><a href =\"https://help.syncfusion.com/dashboard-platform/dashboard-server/site-settings/custom-rebranding\">Custom branding</a> The Dashboard server has built-in customization capabilities such as allowing you to add your organization’s name, logo, welcome note, etc.</p>",
  "summary": "Syncfusion Dashboard Server lets you efficiently organize and share Dashboards through a web interface",
  "githubUsername": "syncfusion-enterpriseserver",
  "dateUpdated": "2017-06-19"
}